app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE (((firstName = 'ae@relativity') OR (lastName = 'ae@relativity')) OR (email = 'ae@relativity'))
---
  def typeahead
    key = params[:input]
    result = User.where("firstName LIKE ?", params[:input]+ "%").or(User.where("lastName LIKE ?", params[:input]+ "%")).or(User.where("email LIKE ?", params[:input]+ "%"))

INSERT INTO "users" ("firstName", "lastName", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["firstName", "Puneeth"], ["lastName", "kumar"], ["email", "pk@gmail.com"], ["created_at", "2022-06-09 09:08:36.637301"], ["updated_at", "2022-06-09 09:08:36.637301"]]
---
  def create
    @user = User.new(user_params)

    if @user.save